{
  "slug": "web-computer-basics",
  "category": "foundation",
  "lastModified": "2025-09-07T00:00:00.000Z",
  "blocks": [
    {
      "type": "heading",
      "level": 1,
      "content": "1.1 Web and Computer Fundamentals"
    },
    {
      "type": "text",
      "content": "Before learning web development, it is essential to understand how computers work and the basics of the Internet. This knowledge acts as the foundation, helping you quickly grasp how browsers and servers interact, making HTML, CSS, and JavaScript easier to learn."
    },

    { "type": "horizontal-rule" }, { "type": "line-break" },

    {
      "type": "heading",
      "level": 2,
      "content": "Computer Basics (Simplified Overview)"
    },
    {
      "type": "list",
      "listType": "unordered",
      "items": [
        "💻 **CPU (Central Processing Unit)**: The brain of the computer, responsible for executing all logic and mathematical operations.",
        "🧠 **RAM (Random Access Memory)**: Short-term workspace that allows the computer to quickly access data used by running programs.",
        "💾 **Storage (Hard Drive / SSD)**: Long-term memory that saves the operating system, applications, and files.",
        "🖥️ **Operating System (OS)**: The coordinator that manages hardware and software, such as Windows, macOS, and Linux."
      ]
    },
    {
      "type": "text",
      "content": "Analogy: The CPU is the brain, RAM is short-term memory, Storage is the library’s bookshelf, and the OS is the librarian managing everything."
    },
    {
      "type": "image",
      "src": "/assets/01-foundation/01-web-computer-basics/CRSO.png",
      "alt": "Computer hardware components",
      "caption": "Four Core Components of a Computer: CPU, RAM, Storage, OS"
    },

    { "type": "line-break" },
    {
      "type": "heading",
      "level": 3,
      "content": "Everyday Examples"
    },
    {
      "type": "list",
      "listType": "unordered",
      "items": [
        "When you open YouTube: The CPU processes video playback logic, RAM temporarily stores video segments, Storage saves downloaded files, and the OS manages the video application.",
        "When you write a Word document: The CPU handles formatting, RAM stores the paragraph you’re typing, and Storage saves the file permanently."
      ]
    },

    { "type": "horizontal-rule" }, { "type": "line-break" },

    {
      "type": "heading",
      "level": 2,
      "content": "Internet Basics"
    },
    {
      "type": "list",
      "listType": "unordered",
      "items": [
        "🌐 **IP Address**: Like a home address, used to uniquely identify devices on the Internet.",
        "📡 **DNS (Domain Name System)**: Works like a phonebook, converting website names (google.com) into IP addresses.",
        "✉️ **HTTP/HTTPS Protocol**: Defines how data is transmitted between browsers and servers. HTTPS is more secure because it uses encryption.",
        "🔗 **Client-Server Model**: The browser (Client) sends a request, and the server (Server) responds with data."
      ]
    },
    {
      "type": "text",
      "content": "Example: When you type www.youtube.com → DNS translates it into an IP address → the browser sends a request using HTTPS → the server responds with video data → the browser displays the video."
    },

    { "type": "line-break" },
    {
      "type": "heading",
      "level": 3,
      "content": "Frontend vs Backend"
    },
    {
      "type": "text",
      "content": "In web development:\n- **Frontend**: The part users can see, such as buttons, text, and images. Common technologies include HTML, CSS, and JavaScript.\n- **Backend**: The hidden logic running on servers, handling requests, accessing databases, and returning results. Common languages include Python, Node.js, and Java."
    },

    { "type": "horizontal-rule" }, { "type": "line-break" },

    {
      "type": "callout",
      "variant": "info",
      "title": "💡 Key Takeaways",
      "content": "Understanding how computers and the Internet work helps you see:\n1. Why browsers need HTML, CSS, and JS to display content.\n2. Why servers need programming languages and databases to process data.\n3. How frontend and backend collaborate to build a complete website."
    },

    { "type": "horizontal-rule" }, { "type": "line-break" },

    {
      "type": "heading",
      "level": 2,
      "content": "Practice Exercises"
    },
    {
      "type": "list",
      "listType": "ordered",
      "items": [
        "Describe in one sentence the role of CPU, RAM, and Storage.",
        "Type a website URL in your browser and think about the steps happening in the background (DNS, HTTP, server response).",
        "Look at an app you use daily and identify which parts are frontend and which parts are backend."
      ]
    }
  ]
}
